# По данному целому неотрицательному n вычислите
# значение n!. N! = 1 * 2 * 3 * … * N
# (произведение всех чисел от 1 до N) 0! = 1
# Решить задачу используя цикл while
# n = int(input())
# sum = 1

# while n > 0:
#     sum = sum * n
#     n = n - 1

# print(sum)

# Дано натуральное число A > 1.
# Определите, каким по счету числом Фибоначчи
# оно является, то есть выведите такое число n,
# что φ(n)=A. Если А не является числом Фибоначчи, выведите число -1.

# 1  2  3  4  5  6  7   8   9  10  11
# 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55,

# a = int(input())
# start_fibo = 0
# next_fibo = 1
# count = 2
# while next_fibo <= a:
#     if (next_fibo == a):
#         print(count)
#         break
#     start_fibo, next_fibo = next_fibo, start_fibo + next_fibo
#     count += 1
# else:
#     print(-1)

# num = int(input())
# f_1 = 0
# f_2 = 1
# i = 2
# while f_2 <= num:
#     if num == f_2:
#         print(i)
#         break
#     f_1, f_2 = f_2, f_1 + f_2
#     i += 1
# else:
#     print(-1)


# Уставшие от необычно теплой зимы, жители решили узнать,
# действительно ли это самая длинная оттепель за всю
# историю наблюдений за погодой. Они обратились к синоптикам,
# а те, в свою очередь, занялись исследованиями статистики
# за прошлые годы. Их интересует, сколько дней длилась самая
# длинная оттепель. Оттепелью они называют период,
# в который среднесуточная температура ежедневно
# превышала 0 градусов Цельсия. Напишите программу,
# помогающую синоптикам в работе.

# Пользователь вводит число N – общее количество
# рассматриваемых дней (1 ≤ N ≤ 100).
# В следующих строках располагается N целых чисел.
# Каждое число – среднесуточная температура в соответствующий день.
# Температуры – целые числа и лежат в диапазоне о

# import os

# os.system('cls')

# n = int(input())
# maximum_row = current_row = 0
# for i in range(n):
#     temp = int(input())
#     if temp > 0:
#         current_row += 1
#     else:
#         if current_row > maximum_row: 
#             maximum_row = current_row
#         current_row = 0
# print(maximum_row)

# Иван Васильевич пришел на рынок и решил купить
# два арбуза: один для себя, а другой для тещи.
# Понятно, что для себя нужно выбрать арбуз потяжелей,
# а для тещи полегче. Но вот незадача: арбузов слишком
# много и он не знает как же выбрать самый легкий
# и самый тяжелый арбуз? Помогите ему!

# Пользователь вводит одно число N – количество арбузов.
# Вторая строка содержит N чисел, записанных на новой
# строчке каждое. Здесь каждое число – это масса соответствующего арбуза

total = int(input())
max = min = int(input('вес первого: '))

for _ in range(total - 1):
    count = int(input())
    if count > max:
        max = count
    if count < min:
        min = count    
print(min, max)