# Даны два массива чисел. Требуется вывести те
# элементы первого массива (в том порядке,
# в каком они идут в первом массиве),
# которых нет во втором массиве.

# Пользователь вводит число N - количество
# элементов в первом массиве,
# затем N чисел - элементы массива.
# Затем число M - количество элементов
# во втором массиве. Затем элементы второго массива

# 7
# 3 1 3 4 2 4 12

# 6
# 4 15 43 1 15 1
'''
mas_1 = [3, 1, 3, 4, 2, 4, 12]
mas_2 = [4, 15, 43, 1, 15, 1]
print(f'массив 1 --> {mas_1}')
print(f'массив 2 --> {mas_2}')

print(*[i for i in mas_1 if i not in mas_2])
'''
# a = list(map(int,input("Введите первый массив:").split()))
# b = list(map(int,input("Введите второй массив:").split()))
# print([item for item in a if item not in b])



# Дан массив, состоящий из целых чисел.
# Напишите программу, которая в данном
# массиве определит количество элементов,
# у которых два соседних и, при этом,
# оба соседних элемента меньше данного.

# Сначала вводится число N — количество
# элементов в массиве. Далее записаны N
# чисел — элементы массива.
# Массив состоит из целых чисел.

# print(len([i for i in range(1, len(mas)-1) if mas[i] > mas[i - 1] and mas[i + 1]]))
'''
a = list(map(int, input("Введите первый массив:").split()))
count = 0
for i in range(1, len(a)-1):
    print(a[i-1:i+2])
    if a[i] == max(a[i-1:i+2]):
        count += 1
print(count)
'''
# a = list(map(int, input("Введите первый массив:").split()))
# count = 0
# for i in range(1, len(a)-1):
#     if a[i] > a[i-1] and a[i] > a[i+1]:
#         count += 1
# print(count)


# Дан список чисел. Посчитайте,
# сколько в нем пар элементов,
# равных друг другу.

# Считается, что любые два элемента,
# равные друг другу образуют одну пару,
# которую необходимо посчитать.
# Вводится список чисел.
# Все числа списка находятся на разных строках.
'''
mas = [1,2,3,2,3,4,4,4]
# mas = [int(input("элементы: ")) for i in range(int(input("кол-во элементов: ")))]
print(mas)
print(sum([mas.count(i) // 2 for i in set(mas)]))
'''

# https://ru.stackoverflow.com/questions/1348243/%d0%9f%d0%be%d0%b8%d1%81%d0%ba-%d0%b4%d1%80%d1%83%d0%b6%d0%b5%d1%81%d1%82%d0%b2%d0%b5%d0%bd%d0%bd%d1%8b%d1%85-%d0%bf%d0%b0%d1%80-%d1%87%d0%b8%d1%81%d0%b5%d0%bb-%d1%81-%d0%bf%d0%be%d0%bc%d0%be%d1%89%d1%8c%d1%8e-%d1%86%d0%b8%d0%ba%d0%bb%d0%be%d0%b2

# https://ru.stackoverflow.com/questions/1348243/
# все делители числа 284
# 220 = 1 + 2 + 4 + 71 + 142
# все делители числа 220
# 284 = 1 + 2 + 4 + 5 + 10 + 11 + 20 + 22 + 44 + 55 + 110

"""
def pair(value):
    # Получаем корень числа, отбрасываем дробную часть
    sq_num = int(value ** 0.5)

    # Выставляем начальное значение в переменной
    # Если переменная sq_num возведённая в квадрат
    # не равна полученному числу, прибавляем 0.
    # Иначе прибавляем это число, т.к. оно тоже множитель
    res = 1 + (0 if sq_num ** 2 != value else sq_num)

    # Цикл от 2 др корня числа
    for i in range(2, sq_num):

        # Если полученное число делиться на i без остатка
        if value % i == 0:
            # Складываем в переменную значение i
            # и второй делитель, например
            # value = 10, i = 2, второй делитель 5
            res += i + value // i
    return res


for j in range(10, 300):
    # Первое число, это сумма множителей j
    sum1 = pair(j)

    # Второе число, это сумма множителей sum1
    sum2 = pair(sum1)

    # Если второе число равно j и первое число меньше второго
    # Второе условие защита от дубликатов,
    # записанных наоборот
    if sum2 == j and sum1 < sum2:
        print(j, sum1)
"""

# 2 домашка
# -5 9 0 3 -1 -2 1 4 -2 10 2 0 -9 8 10 -9 0 -5 -5 7
# 5
# 15
# [1, 9, 13, 14, 19]